#include <REGX52.H>
#include "MoveState.h"
#include "Timer.h"
#include "Delay.h"
#include "Infrared track.h"


sbit D1=P2^6;
sbit D2=P2^5;
sbit D3=P2^4;
sbit D4=P2^3;

void Track()   //1为灭 0为亮   灭1   亮0     检测到黑线为灭1   
{
	
	if(D1==1&&D2==1&&D3==1&&D4==1) 							//小车悬空      灯全灭都为1
		{
			PWML=0;                          //左电机初始转速
			PWMR=0;                       //右电机初始转速
			CarStop();
		}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		
		
	if(D1==0&&D2==1&&D3==0&&D4==0)  //小车右边扫描到黑线（轻微偏左）  小车应该向右移动  0100
		{
			PWML=15;                           //左电机初始转速
			PWMR=9;                       //右电机初始转速
			CarGo();
		}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		
//		if(D1==0&&D2==0&&D3==0&&D4==1)  //小车右边扫描到黑线（转小圈）  小车应该向右移动  1000
//		{
//			
//			PWML=15;                           //左电机初始转速
//			PWMR=40;                       //右电机初始转速
//			CarGo();
//			
//		}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		
	if(D1==0&&D2==0&&D3==1&&D4==0)  //小车左边扫描到黑线（轻微偏右） 小车应该向左移动     0010
		{
			
			PWML=9;                           //左电机初始转速
			PWMR=15;                       //右电机初始转速
			CarGo();
		}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		
		
//		if(D1==0&&D2==0&&D3==1&&D4==1)  //小车左边扫描到黑线（转小圈）  小车应该向左移动  0001
//		{
//			
//			PWML=10;                           //左电机初始转速
//			PWMR=30;                       //右电机初始转速
//			CarGo();
//			
//		}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
		
		
	if(D1==0&&D2==0&&D3==0&&D4==0)  //小车两边都接收到红外线  小车直行      全亮都为0
		{
			
			PWML=11;                           //左电机初始转速
			PWMR=11;                    //右电机初始转速
			CarGo();
			
		}
}
